//观察题目给出的杨辉三角形的图像，可以看出：
//每行第一个数字，对角线数字均为1
//从第二行开始，每行从第二个数字开始，到列数减一为止
//每个数字等于上面一行列与他相同的数字和列号减一的数字的和

#include<stdio.h>
int main(void) {
	int n = 0;
	scanf("%d", &n);
	int a[100][100];
//这里有个比较神奇的办法，因为数组个数并不能为变量
//这里就定义个超大的数组，反正数组其它部分不用来显示
//我们只利用数组里面能显示出杨辉三角的部分即可
//读取一个数字n即可

	/*令第一列与对角线的数字都为1*/
	for (int k = 0; k < n; k++) {
		a[k][0] = 1;
		a[k][k] = 1;
	}
	/*开始计算杨辉三角形*/
	for (int i = 2; i < n; i++) {
		for (int j = 1; j <= i - 1; j++) {
			a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
		}
	}
//输出10行10列的杨辉三角形
	for (int i = 0; i < n; i++) {
		for (int j = 0; j <= i; j++) {
			printf("%d ", a[i][j]);
		}
		printf("\n");
	}
	return 0;
}
