#include<stdio.h>
#include<string.h> 
int main(){
char num1[12]={0},num2[12]={0};//用来保存两个待加减的字符串

while(scanf("%s %s",num1,num2)!=EOF){//不停地读取两个字符串，直到你手动终止 

char new1[12]={0},new2[12]={0};//用来保存删去了逗号的字符串 
int a,b;//用来保存转换成了数字的字符串 
int i1=0,j1=0;
int i2=0,j2=0;



while(num1[i1]!='\0'){ //用来删除左边字符串里面的逗号 
if(num1[i1]!=',')//如果不是逗号就把字符保存到新的数组里面并且两个数组下标同时加1 
new1[j1++]=num1[i1++];
else //如果是逗号只有老数组的下标加1 
++i1; 
}

while(num2[i2]!='\0'){ //用来删除右边字符串里面的逗号
if(num2[i2]!=',') //如果不是逗号就把字符保存到新的数组里面并且两个数组下标同时加1 
new2[j2++]=num2[i2++];
else //如果是逗号只有老数组的下标加1 
++i2; 
}

sscanf(new1,"%d",&a);//将左边的去掉逗号的字符串保存为数字 sscanf用法参考算法笔记P53 
sscanf(new2,"%d",&b);//将右边的去掉逗号的字符串保存为数字 

printf("%d\n",a+b);//将两个数字相加 
}
return 0;

}
